Revit 2027 API
Mullion.MullionType Property
 The MullionType style of this Mullion. Get - to access type of mullion Set - change type of mullion. If the mullion is locked, InvalidOperationException exception will be thrown.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public MullionType MullionType { get; set; }
Public Property MullionType As MullionType
	Get
	Set
public:
property MullionType^ MullionType {
	MullionType^ get ();
	void set (MullionType^ value);
}
member MullionType : MullionType with get, set
Property Value
MullionType
See Also
Reference
Mullion Class
Autodesk.Revit.DB Namespace